Revit 2027 API
View.GetFilters Method
 Gets the filters applied to the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetFilters()
Public Function GetFilters As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetFilters()
member GetFilters : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The ElementIds of the Filters.
Exceptions
Exception | Condition
InvalidOperationException |  The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes.
Remarks
 Note that this method returns filters in a set sorted according to their ids. To get filters in the order they are applied to the view use GetOrderedFilters().
See Also
Reference
View Class
Autodesk.Revit.DB Namespace